podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/LPI2C0_MKE15Z7.svd.xml
            <register>
               <name>MCFGR0</name>
               <description>Master Configuration Register 0</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>HREN</name>
                     <description>Host Request Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Host request input is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Host request input is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HRPOL</name>
                     <description>Host Request Polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Active low</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Active high</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HRSEL</name>
                     <description>Host Request Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Host request input is pin LPI2C_HREQ</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Host request input is input trigger</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CIRFIFO</name>
                     <description>Circular FIFO Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Circular FIFO is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Circular FIFO is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RDMO</name>
                     <description>Receive Data Match Only</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Received data is stored in the receive FIFO as normal</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Received data is discarded unless the RMF is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCFGR1</name>
               <description>Master Configuration Register 1</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>PRESCALE</name>
                     <description>Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>Divide by 1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>Divide by 2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Divide by 4</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Divide by 8</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Divide by 16</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>Divide by 32</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>Divide by 64</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>Divide by 128</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AUTOSTOP</name>
                     <description>Automatic STOP Generation</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>STOP condition is automatically generated whenever the transmit FIFO is empty and LPI2C master is busy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IGNACK</name>
                     <description>When set, the received NACK field is ignored and assumed to be ACK</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>LPI2C Master will receive ACK and NACK normally</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>LPI2C Master will treat a received NACK as if it was an ACK</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIMECFG</name>
                     <description>Timeout Configuration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Pin Low Timeout Flag will set if SCL is low for longer than the configured timeout</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Pin Low Timeout Flag will set if either SCL or SDA is low for longer than the configured timeout</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MATCFG</name>
                     <description>Match Configuration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>Match disabled</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Match enabled (1st data word equals MATCH0 OR MATCH1)</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Match enabled (any data word equals MATCH0 OR MATCH1)</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Match enabled (1st data word equals MATCH0 AND 2nd data word equals MATCH1)</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>Match enabled (any data word equals MATCH0 AND next data word equals MATCH1)</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>Match enabled (1st data word AND MATCH1 equals MATCH0 AND MATCH1)</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>Match enabled (any data word AND MATCH1 equals MATCH0 AND MATCH1)</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PINCFG</name>
                     <description>Pin Configuration</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>LPI2C configured for 2-pin open drain mode</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>LPI2C configured for 2-pin output only mode (ultra-fast mode)</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>LPI2C configured for 2-pin push-pull mode</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>LPI2C configured for 4-pin push-pull mode</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>LPI2C configured for 2-pin open drain mode with separate LPI2C slave</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>LPI2C configured for 2-pin output only mode (ultra-fast mode) with separate LPI2C slave</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>LPI2C configured for 2-pin push-pull mode with separate LPI2C slave</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>LPI2C configured for 4-pin push-pull mode (inverted outputs)</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCFGR2</name>
               <description>Master Configuration Register 2</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>BUSIDLE</name>
                     <description>Bus Idle Timeout</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>FILTSCL</name>
                     <description>Glitch Filter SCL</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FILTSDA</name>
                     <description>Glitch Filter SDA</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCFGR3</name>
               <description>Master Configuration Register 3</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>PINLOW</name>
                     <description>Pin Low Timeout</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDMR</name>
               <description>Master Data Match Register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>MATCH0</name>
                     <description>Match 0 Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MATCH1</name>
                     <description>Match 1 Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCCR0</name>
               <description>Master Clock Configuration Register 0</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>CLKLO</name>
                     <description>Clock Low Period</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CLKHI</name>
                     <description>Clock High Period</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SETHOLD</name>
                     <description>Setup Hold Delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DATAVD</name>
                     <description>Data Valid Delay</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCCR1</name>
               <description>Master Clock Configuration Register 1</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>CLKLO</name>
                     <description>Clock Low Period</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CLKHI</name>
                     <description>Clock High Period</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SETHOLD</name>
                     <description>Setup Hold Delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DATAVD</name>
                     <description>Data Valid Delay</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MFCR</name>
               <description>Master FIFO Control Register</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>TXWATER</name>
                     <description>Transmit FIFO Watermark</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXWATER</name>
                     <description>Receive FIFO Watermark</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MFSR</name>
               <description>Master FIFO Status Register</description>
               <addressOffset>0x5C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXCOUNT</name>
                     <description>Transmit FIFO Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXCOUNT</name>
                     <description>Receive FIFO Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
