podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/LPI2C0_MKE15Z7.svd.xml
            <register>
               <name>SIER</name>
               <description>Slave Interrupt Enable Register</description>
               <addressOffset>0x118</addressOffset>
               <fields>
                  <field>
                     <name>TDIE</name>
                     <description>Transmit Data Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TDIE" > <name>RDIE</name> <description>Receive Data Interrupt Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="TDIE" > <name>AVIE</name> <description>Address Valid Interrupt Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="TDIE" > <name>TAIE</name> <description>Transmit ACK Interrupt Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="TDIE" > <name>RSIE</name> <description>Repeated Start Interrupt Enable</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="TDIE" > <name>SDIE</name> <description>STOP Detect Interrupt Enable</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="TDIE" > <name>BEIE</name> <description>Bit Error Interrupt Enable</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TDIE" > <name>FEIE</name> <description>FIFO Error Interrupt Enable</description> <bitOffset>11</bitOffset> </field>
                  <field>
                     <name>AM0IE</name>
                     <description>Address Match 0 Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Interrupt enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Interrupt disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TDIE" > <name>AM1F</name> <description>Address Match 1 Interrupt Enable</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="TDIE" > <name>GCIE</name> <description>General Call Interrupt Enable</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TDIE" > <name>SARIE</name> <description>SMBus Alert Response Interrupt Enable</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SDER</name>
               <description>Slave DMA Enable Register</description>
               <addressOffset>0x11C</addressOffset>
               <fields>
                  <field>
                     <name>TDDE</name>
                     <description>Transmit Data DMA Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA request disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA request enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TDDE" > <name>RDDE</name> <description>Receive Data DMA Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="TDDE" > <name>AVDE</name> <description>Address Valid DMA Enable</description> <bitOffset>2</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCFGR1</name>
               <description>Slave Configuration Register 1</description>
               <addressOffset>0x124</addressOffset>
               <fields>
                  <field>
                     <name>ADRSTALL</name>
                     <description>Address SCL Stall</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock stretching disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clock stretching enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ADRSTALL" > <name>RXSTALL</name> <description>RX SCL Stall</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ADRSTALL" > <name>TXDSTALL</name> <description>TX Data SCL Stall</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ADRSTALL" > <name>ACKSTALL</name> <description>ACK SCL Stall</description> <bitOffset>3</bitOffset> </field>
                  <field>
                     <name>GCEN</name>
                     <description>General Call Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>General Call address is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>General call address is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAEN</name>
                     <description>SMBus Alert Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disables match on SMBus Alert</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enables match on SMBus Alert</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXCFG</name>
                     <description>Transmit Flag Configuration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Transmit Data Flag will only assert during a slave-transmit transfer when the transmit data register is empty</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Transmit Data Flag will assert whenever the transmit data register is empty</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXCFG</name>
                     <description>Receive Data Configuration</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reading the receive data register will return receive data and clear the receive data flag</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reading the receive data register when the address valid flag is set will return the address status register and clear the address valid flag. Reading the receive data register when the address valid flag is clear will return receive data and clear the receive data flag</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IGNACK</name>
                     <description>Ignore NACK</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Slave will end transfer when NACK detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Slave will not end transfer when NACK detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HSMEN</name>
                     <description>High Speed Mode Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disables detection of Hs-mode master code</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enables detection of Hs-mode master code</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADDRCFG</name>
                     <description>Address Configuration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>Address match 0 (7-bit)</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>Address match 0 (10-bit)</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Address match 0 (7-bit) or Address match 1 (7-bit)</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Address match 0 (10-bit) or Address match 1 (10-bit)</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Address match 0 (7-bit) or Address match 1 (10-bit)</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>Address match 0 (10-bit) or Address match 1 (7-bit)</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>From Address match 0 (7-bit) to Address match 1 (7-bit)</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>From Address match 0 (10-bit) to Address match 1 (10-bit)</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCFGR2</name>
               <description>Slave Configuration Register 2</description>
               <addressOffset>0x128</addressOffset>
               <fields>
                  <field>
                     <name>CLKHOLD</name>
                     <description>Clock Hold Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DATAVD</name>
                     <description>Data Valid Delay</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>FILTSCL</name>
                     <description>Glitch Filter SCL</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FILTSDA</name>
                     <description>Glitch Filter SDA</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAMR</name>
               <description>Slave Address Match Register</description>
               <addressOffset>0x140</addressOffset>
               <fields>
                  <field>
                     <name>ADDR0</name>
                     <description>Address 0 Value</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>ADDR1</name>
                     <description>Address 1 Value</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SASR</name>
               <description>Slave Address Status Register</description>
               <addressOffset>0x150</addressOffset>
               <access>read-only</access>
               <resetValue>0x4000</resetValue>
               <fields>
                  <field>
                     <name>RADDR</name>
                     <description>Received Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>ANV</name>
                     <description>Address Not Valid</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>RADDR is valid</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>RADDR is not valid</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAR</name>
               <description>Slave Transmit ACK Register</description>
               <addressOffset>0x154</addressOffset>
               <fields>
                  <field>
                     <name>TXNACK</name>
                     <description>Transmit NACK</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Transmit ACK for received word</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Transmit NACK for received word</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STDR</name>
               <description>Slave Transmit Data Register</description>
               <addressOffset>0x160</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRDR</name>
               <description>Slave Receive Data Register</description>
               <addressOffset>0x170</addressOffset>
               <access>read-only</access>
               <resetValue>0x4000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Receive Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXEMPTY</name>
                     <description>RX Empty</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The Receive Data Register is not empty</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The Receive Data Register is empty</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SOF</name>
                     <description>Start Of Frame</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Indicates this is not the first data word since a (repeated) START or STOP condition</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Indicates this is the first data word since a (repeated) START or STOP condition</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
